b_h = {
    '0000' : '0', '0001' : '1', '0010' : '2', '0011' : '3',
    '0100' : '4', '0101' : '5', '0110' : '6', '0111' : '7',
    '1000' : '8', '1001' : '9', '1010' : 'A', '1011' : 'B',
    '1100' : 'C', '1101' : 'D', '1110' : 'E', '1111' : 'F',
}
T = int(input())
for tc in range(1, T+1):
    N, bin_str = input().split()
    
    #길이가 4의 배수가 아니면 앞에 0을 채워서 4자리로 딱 떨어지게 해야함
    while len(bin_str) % 4 != 0:
        bin_str = '0' + bin_str
        
    ans = ""
    # 4칸씩 건너뛰면서 글자를 잘라내고 16진수로 바꿔서 이어붙이기
    for i in range(0, len(bin_str), 4):
        chunk = bin_str[i:i+4] #4글자씩 뚝뚝 끊기 (i+3 까지)
        ans += b_h[chunk] #딕셔너리에서 찾아서 붙이기
    
    print(f"#{tc} {ans}")
        