# ========================================================
# 문제: 13020_5186. [파이썬 S/W 문제해결 구현] 1일차 - 이진수2
# 난이도: D2
# 작성자: 윤형섭 (1627575)
# 제출 결과: Pass
# 저장 일시: 2026-10-07 11:29:17
# ========================================================

T = int(input())
for tc in range(1, T + 1):
    N = float(input())
    ans = ""
     while N > 0:
        N *= 2
        if N >= 1:
            ans += "1"
            N -= 1
        else:
            ans += "0"
         if len(ans) >= 13:
            ans = "overflow"
            break
     print(f"#{tc} {ans}")
