"""
문제 구상
주어진 숫자들 중에 서로 다른 3개의 숫자를 고른다.
선택한 3개의 숫자를 더해 그 합이 소수인지 확인한다.
소수가 되는 경우의 개수를 출력한다.

123; 6, 124; 7, 134; 8, 234; 9

127; 10, 126; 9, 124; 7, 176; 14, 174; 12, 164; 11, 276; 15,
274; 13, 264; 12, 764; 17

로직 구상
1. 숫자 3개를 중복 없이 선택한다.
2. 선택한 3개의 숫자를 더한다.
3. 더한 값이 소수인지 확인한다.
4. 소수라면 count를 1 증가시킨다.
5. 마지막에 count를 반환한다.
"""

def solution(nums):
    
    answer = 0
    # 1. 숫자 3개를 중복 없이 선택한다.
    for i in range(len(nums)):
        for j in range(i + 1, len(nums)):
            for k in range(j + 1, len(nums)):
                # 2. 선택한 3개의 숫자를 더한다.
                total = nums[i] + nums[j] + nums[k]
                # 3. 더한 값이 소수인지 확인한다.
                count = 0
                # 3-1. 2부터 합보다 작은 수까지 하나씩 나눴을 때
                for n in range(2, total):
                    if total % n == 0:
                        count += 1
                # 3-2. 나머지의 개수가 0인 것들이 없으면 소수로 판별
                if count == 0:
                    answer += 1
                    
    return answer