"""
문제 구상
N명의 참가자가 토너먼트 경기를 진행한다.
N명의 참가자는 각각 1부터 N번까지의 번호를 부여받는다.
첫 라운드에 1 2, 3 4, ... N-1 N 이런식으로 게임을 진행한다.
각 경기의 승자들은 다시 1부터 N/2번까지의 번호를 부여받고
다시 게임을 진행한다.
최종적으로 우승자가 나올 때까지 경기는 진행된다.
이때 첫 라운드에서 A번을 가진 참가자가 
B번을 가진 참가자를 몇번째 라운드에서 만나는지 구한다.

로직 구상
1. 라운드 수 answer를 0으로 시작한다.
2. A와 B의 번호가 다르면 반복한다.
3. A를 다음 라운드 번호로 변경한다.
4. B도 다음 라운드 번호로 변경한다.
5. 한 라운드가 진행됐으므로 answer += 1 한다.
6. A와 B가 같은 번호가 되면 반복을 종료한다.
7. answer를 반환한다.
"""

def solution(n,a,b):
    answer = 0

    while a != b:
        a = (a + 1) // 2
        b = (b + 1) // 2
        answer += 1

    return answer