import sys
sys.stdin = open("input.txt", "r")

T = int(input())  # 테스트 케이스 input 받기

for test_case in range(1, T + 1):
    # 각 숫자 0~9가 가진 닫힌 공간 개수
    # 0, 1, 2, 3, 4, 5, 6, 7, 8, 9
    # 1, 0, 0, 0, 1, 0, 1, 0, 2, 1
    N = int(input())  # 만들어야 하는 닫힌 공간의 총개수

    # 특수해
    # 닫힌 공간이 1개라면, 가장 작은 수는 0
    if N == 1:
        print(0)

    # 일반해
    else:
        # N이 짝수라면
        # 닫힌 공간이 2개인 숫자 8을 계속 사용하면
        # 가장 짧으면서 가장 작은 수를 만들 수 있음
        if N % 2 == 0:
            print("8" * (N // 2))

        # N이 홀수라면
        # 맨 앞에 닫힌 공간 1개인 4를 놓고,
        # 남은 닫힌 공간은 8로 채움
        elif N % 2 == 1:
            print("4" + "8" * (N // 2))